// 【问题描述】
////小蓝要为一条街的住户制作门牌号。
//这条街一共有 2020位住户，门牌号从1到2020编号。
//小蓝制作门牌的方法是先制作0到9这几个数字字符，最后根据需要将字符粘贴到门牌上，例如门牌 1017需要依次粘贴字符1、0、1、7，即需要1个字符0，2个字符1，1个字符7。
//请问要制作所有的1到 2020号门牌，总共需要多少个字符 2 */




#include <stdio.h>
int main(void)
{
    int i,n, x,count = 0;


    
    for(i = 0; i < 2021; i++){
         n = i;
         while(n){
             x = n % 10;
             if( x == 2){
                 count++;               
             }
             n /= 10;
         }
    }

    printf("count:%d\n",count);
}
